---
type: IFCExtrusionCalculatorUtils
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 1
tags: [revit-api, class]
---

# IFCExtrusionCalculatorUtils

`Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CalculateExtrusionData | — | `` |